{
  "items": [
    {
      "id": 1,
      "title": "Service Design and Creation (SDC)",
      "description": "Open the SDC in a new tab",
      "tooltipDE": "SDC ist das visuelle Modellierungs- und Designtool von ONAP. Es erstellt interne Metadaten, die Assets beschreiben, die von allen ONAP-Komponenten verwendet werden, sowohl zur Entwurfszeit als auch zur Laufzeit.",
      "tooltipEN": "SDC is the ONAP visual modeling and design tool. It creates internal metadata that describes assets used by all ONAP components, both at design time and run time.",
      "imageUrl": "sdc.svg",
      "imageAltText": "SDC image",
      "redirectUrl": "{{.Values.tiles.SDC_URL}}",
      "groups": [],
      "roles": [
        "PORTAL_ADMIN",
        "PORTAL_OPERATOR",
        "PORTAL_DESIGNER"
      ]
    },
    {
      "id": 3,
      "title": "Policy Framework",
      "description": "Open Policy GUI in a new tab",
      "tooltipDE": "Das ONAP Policy Framework legt die Architektur des Frameworks dar und zeigt die APIs, die anderen Komponenten bereitgestellt werden, die mit dem Framework zusammenarbeiten.",
      "tooltipEN": "ONAP Policy Framework lays out the architecture of the framework and shows the APIs provided to other components that interwork with the framework.",
      "imageUrl": "onap.svg",
      "imageAltText": "Policy image",
      "redirectUrl": "{{.Values.tiles.POLICY_URL}}",
      "groups": [],
      "roles": [
        "PORTAL_ADMIN"
      ]
    },
    {
      "id": 4,
      "title": "Service Orchestration (SO) Monitoring",
      "description": "Open SO-Monitoring in a new tab",
      "tooltipDE": "Der ONAP Service Orchestrator bietet die höchste Ebene der Service-Orchestrierung in der ONAP-Architektur.",
      "tooltipEN": "The ONAP Service Orchestrator provides the highest level of service orchestration in the ONAP architecture.",
      "imageUrl": "onap.svg",
      "imageAltText": "SO-Monitoring image",
      "redirectUrl": "{{.Values.tiles.SO_URL}}",
      "groups": [],
      "roles": [
        "PORTAL_OPERATOR"
      ]
    },
    {
      "id": 7,
      "title": "Controller Design Studio (CDS)",
      "description": "Open CDS in a new tab",
      "tooltipDE": "Die CDS Designer Benutzeroberfläche ist ein Framework zur Automatisierung der Auflösung von Ressourcen für die Instanziierung und aller Konfigurationsbereitstellung, wie z. B. die Konfiguration von Day0, Day1 oder Day2.",
      "tooltipEN": "CDS Designer UI is a framework to automate the resolution of resources for instantiation and any config provisioning operation, such as day0, day1, or day2 configuration.",
      "imageUrl": "cds.svg",
      "imageAltText": "CDS image",
      "redirectUrl": "{{.Values.tiles.CDS_URL}}",
      "groups": [],
      "roles": [
        "PORTAL_ADMIN",
        "PORTAL_OPERATOR",
        "PORTAL_DESIGNER"
      ]
    },
    {
      "id": 9,
      "title": "Holmes Rules",
      "description": "Open Holmes in a new tab",
      "tooltipDE": "Das Holmes-Projekt bietet Alarmkorrelation und -analyse für Telekommunikations-Cloudinfrastruktur und -Dienste, einschließlich Hosts, Vims, VNFs und NSs.",
      "tooltipEN": "Holmes project provides alarm correlation and analysis for Telecom cloud infrastructure and services, including hosts, vims, VNFs and NSs.",
      "imageUrl": "onap.svg",
      "imageAltText": "Holmes image",
      "redirectUrl": "{{.Values.tiles.HOLMES_URL}}",
      "groups": [],
      "roles": [
        "PORTAL_ADMIN",
        "PORTAL_OPERATOR",
        "PORTAL_DESIGNER"
      ]
    },
    {
      "id": 10,
      "title": "A&AI Browser",
      "description": "Open the A&AI Browser in a new tab",
      "tooltipDE": "AAI ist eine Komponente der ONAP-Laufzeit (Echtzeitansichten von Ressourcen, Services, Produkten, Kundenabonnements und deren Beziehungen).",
      "tooltipEN": "AAI is a component of ONAP runtime (Real-time views of Resources, Services, Products, Customer Subscriptions and their relationships).",
      "imageUrl": "onap.svg",
      "imageAltText": "A&AI Browser image",
      "redirectUrl": "{{.Values.tiles.AAI_URL}}",
      "groups": [],
      "roles": [
        "PORTAL_ADMIN",
        "PORTAL_OPERATOR",
        "PORTAL_DESIGNER"
      ]
    },
    {
      "id": 11,
      "title": "SDN-C Directed Graph Builder (SDC-C DGB)",
      "description": "Open the SDN-C Directed Graph Builder in a new tab",
      "tooltipDE": "SDNC DG soll eine Ausführungsumgebung für schnell geschriebene und hochgradig angepasste Serviceabläufe bereitstellen.",
      "tooltipEN": "SDNC DG is to provide an execution environment for quickly written and highly customized service flows.",
      "imageUrl": "sdnc-dg.svg",
      "imageAltText": "SDN-C DG image",
      "redirectUrl": "{{.Values.tiles.SDNCDG_URL}}",
      "groups": [],
      "roles": [
        "PORTAL_ADMIN",
        "PORTAL_OPERATOR",
        "PORTAL_DESIGNER"
      ]
    },
    {
      "id": 12,
      "title": "SDN-C Open Daylight UI (SDN-C ODL)",
      "description": "Open the SDN-C Open Daylight UI (SDN-C ODL) in a new tab",
      "tooltipDE": "Das OpenDaylight Project ist ein kollaboratives Open-Source-Projekt, das von der Linux Foundation gehostet wird. Das Projekt dient als Plattform für Software-Defined Networking (SDN) zur offenen, zentralisierten Überwachung von Netzwerkgeräten.",
      "tooltipEN": "The OpenDaylight Project is a collaborative open-source project hosted by The Linux Foundation. The project serves as a platform for software-defined networking (SDN) for open, centralized, network device monitoring.",
      "imageUrl": "sdnc-odl.svg",
      "imageAltText": "SDN-C ODL image",
      "redirectUrl": "{{.Values.tiles.SDNCODL_URL}}",
      "groups": [],
      "roles": [
        "PORTAL_ADMIN",
        "PORTAL_OPERATOR",
        "PORTAL_DESIGNER"
      ]
    }
  ]
}
